//=============================================================================
//
//	ゴール地点の処理 [goal.h]
//	Author : SHUMA AIZU
// 
//=============================================================================

#include "goal.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


//*****************************************************************************
// グローバル変数
//*****************************************************************************
Book g_Book;					// 本の情報

//=============================================================================
// ゴール地点の初期化処理
//=============================================================================
void InitGoal(void)
{
	memset(&g_Book, NULL, sizeof(Book));
}

//=============================================================================
// ゴール地点の終了処理
//=============================================================================
void UninitGoal(void)
{

}

//=============================================================================
// ゴール地点の更新処理
//=============================================================================
void UpdateGoal(void)
{
	UpdateMotion(&g_Book.motion, g_Book.pModelData, &g_Book.OffSetData);
}

//==============================================================================
// ゴール地点の描画処理
//==============================================================================
void DrawGoal(void)
{
	DrawParentModel(&g_Book.pos, &g_Book.rot, &g_Book.mtxWorld, g_Book.pModelData, &g_Book.OffSetData);
}

//==============================================================================
// ゴール地点の設定処理
//==============================================================================
void SetGoal(D3DXVECTOR3 pos, float fRadius)
{
	g_Book.pos = pos;
	g_Book.fRadius = fRadius;
	g_Book.pModelData = SetModelData(PARENTMODELTYPE_BOOK);
	g_Book.motion.pMotionData = SetMotionData(MOTIONDATATYPE_BOOK);

	SetMotion(&g_Book.motion, g_Book.pModelData, &g_Book.OffSetData, MOTIONTYPE_NEUTRAL, true, false, 10);
}

//==============================================================================
// ゴール地点の当たり判定処理
//==============================================================================
bool CollisionGoal(D3DXVECTOR3 pos, float fRadius)
{
	float fDiff = 0.0f;		// 判定用変数

	// 各距離を二乗したものをすべて足す
	fDiff = powf(g_Book.pos.x - pos.x, 2) + powf(g_Book.pos.y - pos.y, 2) + powf(g_Book.pos.z - pos.z, 2);

	if (fDiff <= powf(fRadius + g_Book.fRadius, 2))
	{// 当たっていたら
		return true;		// 真を返す
	}

	return false;			// 当たらなければ偽を返す
}