////=============================================================================
////
////	ポーズ処理 [pause.h]
////	Author : SHUMA AIZU
//// 
////=============================================================================
//
//#ifndef _PAUSE_H_
//#define _PAUSE_H_
//
//#include "main.h"
//
////*****************************************************************************
//// マクロ定義
////*****************************************************************************
//
////*****************************************************************************
//// ポーズモード
////*****************************************************************************
//typedef enum PAUSE_MODE
//{
//	PAUSE_MODE_NEUTRAL = 0,			// なにもない
//	PAUSE_MODE_CLOCK,				// 時計
//	PAUSE_MODE_MAGICBOOK,			// 魔導書
//	PAUSE_MODE_MAX,
//}PAUSE_MODE;
//
////*****************************************************************************
//// ポーズメニュー
////*****************************************************************************
//typedef enum PAUSE_MENU
//{
//	PAUSE_MENU_CLOCK = 0,			// 時計
//	PAUSE_MENU_MAGICBOOK,			// 魔導書
//	PAUSE_MENU_CONTINUE,			// ゲームに戻る
//	PAUSE_MENU_RESTART,				// ゲームをやり直す
//	PAUSE_MENU_QUIT,				// タイトル画面に戻る
//	PAUSE_MENU_MAX					// 
//}PAUSE_MENU;
//
////*****************************************************************************
//// ポーズメニュー情報構造体
////*****************************************************************************
//typedef struct
//{
//	D3DXVECTOR3 pos;		// 位置
//	D3DXVECTOR3 rot;		// 向き
//	float fWidth;			// 幅
//	float fHeight;			// 高さ
//	float fLength;			// 長さ
//	float fAngle;			// 角度
//}PauseMenuInfo;
//
////*****************************************************************************
//// プロトタイプ宣言
////*****************************************************************************
//void InitPause(void);
//void UninitPause(void);
//void UpdatePause(void);
//void DrawPause(void);
//void SetPauseMenu(PAUSE_MENU pause_menu);
//bool GetPauseDisp(void);
//
//#endif